; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_1 type_3)
 (:predicates (pred_3 ?v5 - type_1 ?v2 - type_2)
 	      (pred_1 ?v4 - object ?v2 - type_2)
	      (pred_4 ?v5 - type_1 ?v8 - type_3)
	      (pred_2 ?v5 - type_1 ?v4 - object ?v8 - type_3))

   (:action op_3
       :parameters  (?v5 - type_1 ?v1 ?v7 - type_2)
       :precondition (and  (pred_3 ?v5 ?v1))
       :effect (and  (pred_3 ?v5 ?v7)
		     (not (pred_3 ?v5 ?v1))))

   (:action op_2
       :parameters (?v5 - type_1 ?v3 - object ?v6 - type_2 ?v8 - type_3)
       :precondition  (and  (pred_1 ?v3 ?v6) (pred_3 ?v5 ?v6) (pred_4 ?v5 ?v8))
       :effect (and (pred_2 ?v5 ?v3 ?v8)
		    (not (pred_1 ?v3 ?v6)) 
		    (not (pred_4 ?v5 ?v8))))

   (:action op_1
       :parameters (?v5 - type_1 ?v3 - object ?v6 - type_2 ?v8 - type_3)
       :precondition  (and  (pred_2 ?v5 ?v3 ?v8) (pred_3 ?v5 ?v6))
       :effect (and (pred_1 ?v3 ?v6)
		    (pred_4 ?v5 ?v8)
		    (not (pred_2 ?v5 ?v3 ?v8)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_10 obj_13 - type_1
obj_02 obj_06 obj_01 obj_04 - type_3
obj_12 obj_09 obj_11 obj_08 - type_2
obj_07 obj_03 obj_05 - object)
(:init
(pred_3 obj_10 obj_09)
(pred_4 obj_10 obj_02)
(pred_4 obj_10 obj_06)
(pred_3 obj_13 obj_09)
(pred_4 obj_13 obj_01)
(pred_4 obj_13 obj_04)
(pred_1 obj_07 obj_11)
(pred_1 obj_03 obj_12)
(pred_1 obj_05 obj_12)
)
(:goal
(and
(pred_1 obj_07 obj_09)
(pred_1 obj_03 obj_11)
(pred_1 obj_05 obj_11)
)
)

(:constraints
  (always (not (pred_3 obj_10 obj_11)))
)
)

; plan
1. (op_3 obj_10 obj_09 obj_12)
   deleted: (pred_3 obj_10 obj_09)
   added: (pred_3 obj_10 obj_12)
   goals met: 0 of 3
2. (op_3 obj_13 obj_09 obj_11)
   deleted: (pred_3 obj_13 obj_09)
   added: (pred_3 obj_13 obj_11)
   goals met: 0 of 3
3. (op_2 obj_13 obj_07 obj_11 obj_04)
   deleted: (pred_1 obj_07 obj_11) (pred_4 obj_13 obj_04)
   added: (pred_2 obj_13 obj_07 obj_04)
   goals met: 0 of 3
4. (op_2 obj_10 obj_05 obj_12 obj_06)
   deleted: (pred_1 obj_05 obj_12) (pred_4 obj_10 obj_06)
   added: (pred_2 obj_10 obj_05 obj_06)
   goals met: 0 of 3
5. (op_2 obj_10 obj_03 obj_12 obj_02)
   deleted: (pred_1 obj_03 obj_12) (pred_4 obj_10 obj_02)
   added: (pred_2 obj_10 obj_03 obj_02)
   goals met: 0 of 3
6. (op_3 obj_13 obj_11 obj_09)
   deleted: (pred_3 obj_13 obj_11)
   added: (pred_3 obj_13 obj_09)
   goals met: 0 of 3
7. (op_1 obj_10 obj_05 obj_12 obj_06)
   deleted: (pred_2 obj_10 obj_05 obj_06)
   added: (pred_1 obj_05 obj_12) (pred_4 obj_10 obj_06)
   goals met: 0 of 3
8. (op_1 obj_10 obj_03 obj_12 obj_02)
   deleted: (pred_2 obj_10 obj_03 obj_02)
   added: (pred_1 obj_03 obj_12) (pred_4 obj_10 obj_02)
   goals met: 0 of 3
9. (op_1 obj_13 obj_07 obj_09 obj_04)
   deleted: (pred_2 obj_13 obj_07 obj_04)
   added: (pred_1 obj_07 obj_09) (pred_4 obj_13 obj_04)
   goals met: 1 of 3
10. (op_3 obj_13 obj_09 obj_12)
   deleted: (pred_3 obj_13 obj_09)
   added: (pred_3 obj_13 obj_12)
   goals met: 1 of 3
11. (op_2 obj_13 obj_05 obj_12 obj_04)
   deleted: (pred_1 obj_05 obj_12) (pred_4 obj_13 obj_04)
   added: (pred_2 obj_13 obj_05 obj_04)
   goals met: 1 of 3
12. (op_3 obj_13 obj_12 obj_11)
   deleted: (pred_3 obj_13 obj_12)
   added: (pred_3 obj_13 obj_11)
   goals met: 1 of 3
13. (op_1 obj_13 obj_05 obj_11 obj_04)
   deleted: (pred_2 obj_13 obj_05 obj_04)
   added: (pred_1 obj_05 obj_11) (pred_4 obj_13 obj_04)
   goals met: 2 of 3
14. (op_3 obj_13 obj_11 obj_12)
   deleted: (pred_3 obj_13 obj_11)
   added: (pred_3 obj_13 obj_12)
   goals met: 2 of 3
15. (op_2 obj_13 obj_03 obj_12 obj_04)
   deleted: (pred_1 obj_03 obj_12) (pred_4 obj_13 obj_04)
   added: (pred_2 obj_13 obj_03 obj_04)
   goals met: 2 of 3
16. (op_3 obj_13 obj_12 obj_11)
   deleted: (pred_3 obj_13 obj_12)
   added: (pred_3 obj_13 obj_11)
   goals met: 2 of 3
17. (op_1 obj_13 obj_03 obj_11 obj_04)
   deleted: (pred_2 obj_13 obj_03 obj_04)
   added: (pred_1 obj_03 obj_11) (pred_4 obj_13 obj_04)
   goals met: 3 of 3
